app/Controllers/Admin.php

    public function inicio()
    {
        $data['link'] = [
            'item' => '1'
        ];

        $data['empresas'] = count(
                                $this->empresa_model
                                                ->findAll()
                            );

        $data['produtos'] = count(
                                $this->produto_model
                                            ->findAll()
                            );

        $data['clientes'] = count(
                                $this->cliente_model
                                                ->findAll()
                            );

        $data['vendas'] = count(
                                $this->venda_model
                                            ->findAll()
                            );

        $data['empresas_que_vencem_hoje'] = $this->empresa_model
                                                    ->where('dia_do_pagamento', date('d'))
                                                    ->findAll();
---
SELECT *
FROM `empresas`
SELECT *
FROM `produtos`
SELECT *
FROM `clientes`
SELECT *
FROM `vendas`
SELECT *
FROM `empresas`
WHERE `dia_do_pagamento` = '29'