app/Controllers/Configuracoes.php

SELECT *
FROM `login`
WHERE `id_login` = 1
 LIMIT 1
---
    public function editLogin()
    {
        $data['link'] = [
            'li' => '5.x',
            'item' => '5.0',
            'subItem' => '5.2'
        ];

        $data['titulo'] = [
            'modulo' => 'Configurações do Login',
            'icone'  => 'fa fa-user-circle'
        ];

        $data['caminhos'] = [
            ['titulo' => "Início", 'rota' => "/admin/inicio", 'active' => false],
            ['titulo' => "Configuracoes", 'rota'   => "", 'active' => true]
        ];

        $data['configuracao'] = $this->configuracao_model
                                    ->where('id_config', 1)
                                    ->first();

        $data['login'] = $this->login_model
                            ->where('id_login', 1)
                            ->first();