app/Controllers/Empresas.php

SELECT *
FROM `empresas`
---

        else:

            $data['empresas'] = $this->empresa_model
                                            ->findAll();

DELETE FROM `empresas`
WHERE `id_empresa` = '2'
DELETE FROM `login`
WHERE `id_empresa` = '2'
---
    public function delete($id_empresa)
    {
        // Apaga primeiro a empresa
        $this->empresa_model
            ->where('id_empresa', $id_empresa)
            ->delete();

        // Depois apaga todos os usuários cadastrados para essa empresa
        $this->login_model
            ->where('id_empresa', $id_empresa)
            ->delete();