app/Controllers/FormasDePagamento.php

    public function index()
    {
        if($this->session->get('tipo') != $this->tipo) :
            $this->session->setFlashdata(
                'alert',
                [
                    'type' => 'error',
                    'title' => 'Acesso negado, você não tem permissão para fazer esse acesso!'
                ]
            );
            return redirect()->to('/login');
        endif;
        // -------------------------------------------------------------------- //

        $data['link'] = $this->link;

        $data['titulo'] = [
            'modulo' => 'Formas de Pagamento',
            'icone'  => 'fa fa-database'
        ];

        $data['caminhos'] = [
            ['titulo' => "Início", 'rota' => "/inicio", 'active' => false],
            ['titulo' => "Formas de Pagamento", 'rota'   => "", 'active' => true]
        ];

        $data['formas_de_pagamento'] = $this->forma_de_pagamento_model->findAll();
---
SELECT *
FROM `formas_de_pagamento`