app/Controllers/Login.php

    public function autenticar()
    {
        $dados = $this->request->getvar();

        $login = $this->login_model
                    ->where('usuario', $dados['usuario'])
                    ->where('senha', $dados['senha'])
                    ->first();
---
SELECT *
FROM `login`
WHERE `usuario` = 'admin'
AND `senha` = '123'
 LIMIT 1